Sinsjr2/Arcavirt/doc/spec/RegisterSvdReference/rx64m-can-pilot.svd
        <register>
          <name>EIFR</name>
          <addressOffset>0x64D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>BEIF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWIF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPIF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOEIF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BORIF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ORIF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OLIF</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BLIF</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RECR</name>
          <addressOffset>0x64E</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TECR</name>
          <addressOffset>0x64F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ECSR</name>
          <addressOffset>0x650</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SEF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AEF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BE1F</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BE0F</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADEF</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EDPM</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSSR</name>
          <addressOffset>0x651</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
        <register>
          <name>MSSR</name>
          <addressOffset>0x652</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>MBNST</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SEST</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MSMR</name>
          <addressOffset>0x653</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>MBSM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSR</name>
          <addressOffset>0x654</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AFSR</name>
          <addressOffset>0x656</addressOffset>
          <size>16</size>
          <access>read-write</access>
        </register>
        <register>
          <name>TCR</name>
          <addressOffset>0x658</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>TSTE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTM</name>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>MB%s</name>
          <description>MB register cluster, 32 elements.</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>ID</name>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <fields>
              <field>
                <name>EID</name>
                <bitOffset>0</bitOffset>
                <bitWidth>18</bitWidth>
              </field>
              <field>
                <name>SID</name>
                <bitOffset>18</bitOffset>
                <bitWidth>11</bitWidth>
              </field>
              <field>
                <name>RTR</name>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>IDE</name>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DLC</name>
            <addressOffset>0x4</addressOffset>
            <size>16</size>
            <access>read-write</access>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x1</dimIncrement>
            <name>DATA%s</name>
            <addressOffset>0x6</addressOffset>
            <size>8</size>
            <access>read-write</access>
          </register>
          <register>
            <name>TS</name>
            <addressOffset>0xE</addressOffset>
            <size>16</size>
            <access>read-write</access>
          </register>
        </cluster>
